'''
F(n) = G(n – 1),
G(n) = n, если n < 10,
G(n) = G(n – 2) + 1, если n ≥ 10.
Определите количество значений n на отрезке [1, 100], для которых значение функции F(n) будет полным квадратом некоторого натурального числа.

'''
def f(n):
    return g(n-1)
def g(n):
    if n <10:
        return n
    return g(n-2)+1
count = 0
for i in range(1,100+1):
    n= f(i)
    if int(n**0.5)==n**0.5:
        count+=1
        print(f'при {i} = {n} = {n**0.5}')
print(count)