'''
ПОКА нашлось(555) ИЛИ нашлось(11) ИЛИ нашлось(2)
  ЕСЛИ нашлось(555)
    ТО заменить(555,1)
  КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось(11)
    ТО заменить(11,25)
  КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось(2)
    ТО заменить(2, 5)
  КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
'''

for n in range(101,150):
    # print('при n',n)
    s = '5'*n

    while '555' in s or '11' in s or '2' in s:
        if '555' in s:
            s = s.replace('555', '1', 1)
        if '11' in s:
            s = s.replace('11', '25', 1)
        if '2' in s:
            s = s.replace('2', '5', 1)
        # print(s)

    if s == '15':
        print(n)




