"""
НАЧАЛО
ПОКА нашлось (72) ИЛИ нашлось (522) ИЛИ нашлось (2222)
  ЕСЛИ нашлось (72)
    ТО заменить (72, 2)
  КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось (522)
    ТО заменить (522, 27)
  КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось (2222)
    ТО заменить (2222, 5)
  КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
КОНЕЦ
"""
def SUMM(string):
    return sum(int(x) for x in string)


for n in range(3,5000):
    # print('при n',n)
    s = '5'+"2"*n

    while '72' in s or '522' in s or '2222' in s:
        if '72' in s:
            s = s.replace('72', '2', 1)
        if '522' in s:
            s = s.replace('522', '27', 1)
        if '2222' in s:
            s = s.replace('2222', '5', 1)
    if SUMM(s) == 63:
        print(f' строка {s} при {n} {SUMM(s)}')

